Autodesk.Revit.DB.StdPostedWarning.UpdateWarning(Autodesk.Revit.DB.Document,System.Boolean)
Updates warning state.
doc:
document
state:
state
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.StdPostedWarning.#ctor(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.FailureDefinitionId)
Construct structure containing failure identity and element id.
elementId:
The identity of element.
failureDefinitionId:
The identity of failure.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.StdPostedWarning.#ctor(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.FailureDefinitionId)
Construct structure containing failure identity and element id.
elemIds:
The identities of elements.
failureDefinitionId:
The identity of failure.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019